bdionello/ECE499/STM32L0_Project1/Core/Src/main_debug.c
  /* USER CODE END SPI1_Init 0 */

  /* USER CODE BEGIN SPI1_Init 1 */

  /* USER CODE END SPI1_Init 1 */
  /* SPI1 parameter configuration*/
  hspi1.Instance = SPI1;
  hspi1.Init.Mode = SPI_MODE_MASTER;
  hspi1.Init.Direction = SPI_DIRECTION_1LINE;
  hspi1.Init.DataSize = SPI_DATASIZE_8BIT;
  hspi1.Init.CLKPolarity = SPI_POLARITY_LOW;
  hspi1.Init.CLKPhase = SPI_PHASE_1EDGE;
  hspi1.Init.NSS = SPI_NSS_SOFT;
  hspi1.Init.BaudRatePrescaler = SPI_BAUDRATEPRESCALER_2;
  hspi1.Init.FirstBit = SPI_FIRSTBIT_MSB;
  hspi1.Init.TIMode = SPI_TIMODE_DISABLE;
  hspi1.Init.CRCCalculation = SPI_CRCCALCULATION_DISABLE;
  hspi1.Init.CRCPolynomial = 7;
  if (HAL_SPI_Init(&hspi1) != HAL_OK)
  {
    Error_Handler();
  }
  /* USER CODE BEGIN SPI1_Init 2 */


  /* USER CODE END SPI1_Init 2 */

}

/**
  * @brief TIM6 Initialization Function
  * @param None
  * @retval None
  */
static void MX_TIM6_Init(void)
{

  /* USER CODE BEGIN TIM6_Init 0 */

  /* USER CODE END TIM6_Init 0 */

  TIM_MasterConfigTypeDef sMasterConfig = {0};

  /* USER CODE BEGIN TIM6_Init 1 */

  /* USER CODE END TIM6_Init 1 */
  htim6.Instance = TIM6;
  htim6.Init.Prescaler = 0;
  htim6.Init.CounterMode = TIM_COUNTERMODE_UP;
  htim6.Init.Period = 1920;
  htim6.Init.AutoReloadPreload = TIM_AUTORELOAD_PRELOAD_DISABLE;
  if (HAL_TIM_Base_Init(&htim6) != HAL_OK)
  {
    Error_Handler();
  }
  sMasterConfig.MasterOutputTrigger = TIM_TRGO_UPDATE;
  sMasterConfig.MasterSlaveMode = TIM_MASTERSLAVEMODE_DISABLE;
  if (HAL_TIMEx_MasterConfigSynchronization(&htim6, &sMasterConfig) != HAL_OK)
  {
    Error_Handler();
  }
  /* USER CODE BEGIN TIM6_Init 2 */
	if (HAL_TIM_Base_Start(&htim6) != HAL_OK) {
		/* Starting Error */
		Error_Handler();
	}
  /* USER CODE END TIM6_Init 2 */

}

/**
  * @brief TIM21 Initialization Function
  * @param None
  * @retval None
  */
static void MX_TIM21_Init(void)
{

  /* USER CODE BEGIN TIM21_Init 0 */

  /* USER CODE END TIM21_Init 0 */

  TIM_ClockConfigTypeDef sClockSourceConfig = {0};
  TIM_MasterConfigTypeDef sMasterConfig = {0};
  TIM_OC_InitTypeDef sConfigOC = {0};

  /* USER CODE BEGIN TIM21_Init 1 */

  /* USER CODE END TIM21_Init 1 */
  htim21.Instance = TIM21;
  htim21.Init.Prescaler = 0;
  htim21.Init.CounterMode = TIM_COUNTERMODE_UP;
  htim21.Init.Period = 640;
  htim21.Init.ClockDivision = TIM_CLOCKDIVISION_DIV1;
  htim21.Init.AutoReloadPreload = TIM_AUTORELOAD_PRELOAD_DISABLE;
  if (HAL_TIM_Base_Init(&htim21) != HAL_OK)
  {
    Error_Handler();
  }
  sClockSourceConfig.ClockSource = TIM_CLOCKSOURCE_INTERNAL;
  if (HAL_TIM_ConfigClockSource(&htim21, &sClockSourceConfig) != HAL_OK)
  {
    Error_Handler();
  }
  if (HAL_TIM_PWM_Init(&htim21) != HAL_OK)
  {
    Error_Handler();
  }
  sMasterConfig.MasterOutputTrigger = TIM_TRGO_RESET;
  sMasterConfig.MasterSlaveMode = TIM_MASTERSLAVEMODE_DISABLE;
  if (HAL_TIMEx_MasterConfigSynchronization(&htim21, &sMasterConfig) != HAL_OK)
  {
    Error_Handler();
  }
  sConfigOC.OCMode = TIM_OCMODE_PWM1;
  sConfigOC.Pulse = 64;
  sConfigOC.OCPolarity = TIM_OCPOLARITY_HIGH;
  sConfigOC.OCFastMode = TIM_OCFAST_DISABLE;
  if (HAL_TIM_PWM_ConfigChannel(&htim21, &sConfigOC, TIM_CHANNEL_1) != HAL_OK)
  {
    Error_Handler();
  }
  /* USER CODE BEGIN TIM21_Init 2 */
  /* USER CODE END TIM21_Init 2 */
  HAL_TIM_MspPostInit(&htim21);

}

/**
  * @brief USART1 Initialization Function
  * @param None
  * @retval None
  */
static void MX_USART1_UART_Init(void)
{

  /* USER CODE BEGIN USART1_Init 0 */

  /* USER CODE END USART1_Init 0 */

  /* USER CODE BEGIN USART1_Init 1 */

  /* USER CODE END USART1_Init 1 */
  huart1.Instance = USART1;
  huart1.Init.BaudRate = 9600;
  huart1.Init.WordLength = UART_WORDLENGTH_8B;
  huart1.Init.StopBits = UART_STOPBITS_1;
  huart1.Init.Parity = UART_PARITY_NONE;
  huart1.Init.Mode = UART_MODE_TX;
  huart1.Init.HwFlowCtl = UART_HWCONTROL_NONE;
  huart1.Init.OverSampling = UART_OVERSAMPLING_16;
  huart1.Init.OneBitSampling = UART_ONE_BIT_SAMPLE_DISABLE;
  huart1.AdvancedInit.AdvFeatureInit = UART_ADVFEATURE_NO_INIT;
  if (HAL_UART_Init(&huart1) != HAL_OK)
  {
    Error_Handler();
  }
  /* USER CODE BEGIN USART1_Init 2 */


  /* USER CODE END USART1_Init 2 */

}

/**
  * Enable DMA controller clock
  */
static void MX_DMA_Init(void)
{

  /* DMA controller clock enable */
  __HAL_RCC_DMA1_CLK_ENABLE();

  /* DMA interrupt init */
  /* DMA1_Channel1_IRQn interrupt configuration */
  HAL_NVIC_SetPriority(DMA1_Channel1_IRQn, 0, 0);
  HAL_NVIC_EnableIRQ(DMA1_Channel1_IRQn);
  /* DMA1_Channel2_3_IRQn interrupt configuration */
  HAL_NVIC_SetPriority(DMA1_Channel2_3_IRQn, 0, 0);
  HAL_NVIC_EnableIRQ(DMA1_Channel2_3_IRQn);

}

/**
  * @brief GPIO Initialization Function
  * @param None
  * @retval None
  */
static void MX_GPIO_Init(void)
{
  GPIO_InitTypeDef GPIO_InitStruct = {0};
/* USER CODE BEGIN MX_GPIO_Init_1 */
/* USER CODE END MX_GPIO_Init_1 */

  /* GPIO Ports Clock Enable */
  __HAL_RCC_GPIOC_CLK_ENABLE();
  __HAL_RCC_GPIOH_CLK_ENABLE();
  __HAL_RCC_GPIOA_CLK_ENABLE();
  __HAL_RCC_GPIOB_CLK_ENABLE();

  /*Configure GPIO pin Output Level */
  HAL_GPIO_WritePin(GPIOB, ePD1_RESET_Pin|ePD1_PWR_ENn_Pin|ePD1_D_C_Pin|GPIO_LOAD_CTL_Pin, GPIO_PIN_RESET);

  /*Configure GPIO pin Output Level */
  HAL_GPIO_WritePin(ePD1_CS_GPIO_Port, ePD1_CS_Pin, GPIO_PIN_RESET);

  /*Configure GPIO pins : ePD1_RESET_Pin ePD1_PWR_ENn_Pin ePD1_D_C_Pin GPIO_LOAD_CTL_Pin */
  GPIO_InitStruct.Pin = ePD1_RESET_Pin|ePD1_PWR_ENn_Pin|ePD1_D_C_Pin|GPIO_LOAD_CTL_Pin;
  GPIO_InitStruct.Mode = GPIO_MODE_OUTPUT_PP;
  GPIO_InitStruct.Pull = GPIO_NOPULL;
  GPIO_InitStruct.Speed = GPIO_SPEED_FREQ_LOW;
  HAL_GPIO_Init(GPIOB, &GPIO_InitStruct);

  /*Configure GPIO pin : ePD1_BUSY_Pin */
  GPIO_InitStruct.Pin = ePD1_BUSY_Pin;
  GPIO_InitStruct.Mode = GPIO_MODE_INPUT;
  GPIO_InitStruct.Pull = GPIO_NOPULL;
  HAL_GPIO_Init(ePD1_BUSY_GPIO_Port, &GPIO_InitStruct);

  /*Configure GPIO pin : ePD1_CS_Pin */
  GPIO_InitStruct.Pin = ePD1_CS_Pin;
  GPIO_InitStruct.Mode = GPIO_MODE_OUTPUT_PP;
  GPIO_InitStruct.Pull = GPIO_NOPULL;
  GPIO_InitStruct.Speed = GPIO_SPEED_FREQ_LOW;
  HAL_GPIO_Init(ePD1_CS_GPIO_Port, &GPIO_InitStruct);

  /*Configure GPIO pins : MFX_I2C_SCL_Pin MFX_I2C_SDA_Pin */
  GPIO_InitStruct.Pin = MFX_I2C_SCL_Pin|MFX_I2C_SDA_Pin;
  GPIO_InitStruct.Mode = GPIO_MODE_AF_OD;
  GPIO_InitStruct.Pull = GPIO_PULLUP;
  GPIO_InitStruct.Speed = GPIO_SPEED_FREQ_VERY_HIGH;
  GPIO_InitStruct.Alternate = GPIO_AF4_I2C1;
  HAL_GPIO_Init(GPIOB, &GPIO_InitStruct);

/* USER CODE BEGIN MX_GPIO_Init_2 */
/* USER CODE END MX_GPIO_Init_2 */
}

/* USER CODE BEGIN 4 */
// function definitions funcdef
/* increments the duty cycle of the PWM in direction "dir" by value "size"
 * @ param dir = 1 for up, 0 for down
 * @ param size is increment value
 * @ returns 0 for success, 1 if limit is hit */
static int PWM_DC_Step(int dir, int size) {
	int status = 0;
	int pulse = TIM21->CCR1;
	if (dir) {
		pulse += size;
	} else {
		pulse -= size;
	}
	if (pulse >= pulse_max) {
		pulse = pulse_max;
		status = 1;
	}
	if (pulse <= pulse_min) {
		pulse = pulse_min;
		status = 1;
	}
	TIM21->CCR1 = pulse;
	return status;
}
/* MPPT Algorithm
 * @Takes a pointer to the voltage and current from the output
 * @of the solar panel and performs the incremental conductance algorithm.
 * @Modifies the PWM output based on dV and dI.  */
static int inc_Con(void) {
	char exit = 0;
	char status = 0;
	char state = 0;
	//int dV = 0;
	//int dI = 0;
	//float dIdV = 0;
	//float IV = 0;
	update_inputs();
	//uint16_t  oldVolt = v_sol;
	//uint16_t  oldCurrent = i_sol;
	oldVolt = v_sol;
	oldCurrent = i_sol;
	HAL_Delay(500);
	update_inputs();
	//uint16_t voltage = v_sol;
	//uint16_t current = i_sol;
	voltage = v_sol;
	current = i_sol;
	dV = voltage - oldVolt;
	dI = current - oldCurrent;
	dIdV = (float)dI/(float)dV;
	IV = -(float)current / (float)voltage;
	while (exit == 0){
		switch (state) {
			case 0:
				if (dV == 0) {
					state = 1;
					break;
				} else {
					state = 2;
					break;
				}
			case 1:
				if (dI == 0) {
					state = 0;
					status = 0;
					exit = 1;
					break;
				} else {
					state = 3;
					break;
				}
			case 2:
				if ((int)(dIdV*100)==(int)(IV*100)) {
					state = 0;
					status = 0;
					exit = 1;
					break;
				} else {
					state = 4;
					break;
				}
			case 3:
				if (dI > 0) {
					//status = PWM_DC_Step(1, 7);
					state = 0;
					exit = 1;
					break;
				} else {
					//status = PWM_DC_Step(0, 7);
					state = 0;
					exit = 1;
					break;
				}
			case 4:
				if ((int)(dIdV*1000)>(int)(IV*1000)) {
					//status = PWM_DC_Step(0, 7);
					state = 0;
					exit = 1;
					break;
				} else {
					//status = PWM_DC_Step(1, 7);
					state = 0;
					exit = 1;
					break;
				}
			default:
				status = 1;
				exit = 1;
				break;
		}
	}
	return (status);
}

/* Refreshes screen
 * @Uses a temp char array to hold value of current and voltage scaled to milli.
 * @Displays a sun or moon depending on if solar voltage is higher or lower than battery voltage
 * @Refreshes that bad boy  */
void refreshDisplay(void) {
	//v_sol = (rand() % (4095 - 0 + 1)) + 0;
	int tempVal = v_sol * VSOL_SCALE;
	char tempStr[6]; //Should be good up to 99999 mA/mV
	sprintf(tempStr, "%i", tempVal);
	BSP_EPD_Clear(EPD_COLOR_WHITE);
	BSP_EPD_SetFont(&Font12);
	BSP_EPD_DisplayStringAt(1, 0, "Panel Voltage is: ", LEFT_MODE);
	BSP_EPD_DisplayStringAt(130, 0, tempStr, LEFT_MODE);
	BSP_EPD_DisplayStringAt(170, 0, "mV", LEFT_MODE);
	//test = 1337; //test variable, replace with I_sol and scale to mA
	//i_sol = (rand() % (4095 - 0 + 1)) + 0;
	tempVal = i_sol * ISOL_SCALE;
	sprintf(tempStr, "%i", tempVal);
	BSP_EPD_DisplayStringAt(1, 3, "Panel Current is: ", LEFT_MODE);
	BSP_EPD_DisplayStringAt(130, 3, tempStr, LEFT_MODE);
	BSP_EPD_DisplayStringAt(170, 3, "mA", LEFT_MODE);
	//test = 12312; //test variable, replace with v_bat and scale to mV
	//v_bat = (rand() % (4095 - 0 + 1)) + 0;
	tempVal = v_bat * VBAT_SCALE;
	sprintf(tempStr, "%i", tempVal);
	BSP_EPD_DisplayStringAt(1, 6, "Battery Voltage is: ", LEFT_MODE);
	BSP_EPD_DisplayStringAt(140, 6, tempStr, LEFT_MODE);
	BSP_EPD_DisplayStringAt(180, 6, "mV", LEFT_MODE);
	//test = 1613; //test variable, replace with I_bat and scale to mA
	//i_bat = (rand() % (4095 - 0 + 1)) + 0;
	tempVal = i_bat * IBAT_SCALE;
	sprintf(tempStr, "%i", tempVal);
	BSP_EPD_DisplayStringAt(1, 9, "Battery Current is: ", LEFT_MODE);
	BSP_EPD_DisplayStringAt(140, 9, tempStr, LEFT_MODE);
	BSP_EPD_DisplayStringAt(180, 9, "mA", LEFT_MODE);
	if (v_sol >= VSOL_OK_VOLTAGE) {
		BSP_EPD_DisplayStringAt(1, 12, "Solar Present", LEFT_MODE);
		BSP_EPD_DrawImage(200, 0, 30, 45, Sun);
	} else {
		BSP_EPD_DisplayStringAt(1, 12, "Solar Hidden", LEFT_MODE);
		BSP_EPD_DrawImage(200, 0, 30, 45, Moon);
	}
	if (v_bat < VBAT_LOW_VOLTAGE) {
		BSP_EPD_DisplayStringAt(95, 12, "|Batt Low", LEFT_MODE);
		BSP_EPD_DrawImage(200, 6, 30, 45, batLow);
	} else if (v_bat >= VBAT_OK_VOLTAGE && v_bat <= VBAT_HIGH_VOLTAGE) {
		BSP_EPD_DisplayStringAt(95, 12, "|Batt Charge", LEFT_MODE);
		BSP_EPD_DrawImage(200, 6, 30, 45, batCharge);
	} else {
		BSP_EPD_DisplayStringAt(95, 12, "|Batt Full", LEFT_MODE);
		BSP_EPD_DrawImage(200, 6, 30, 45, batFull);
	}
	if (loadState == 0){
		BSP_EPD_DisplayStringAt(185, 12, "|Load Off", LEFT_MODE);
	}
	else {
		BSP_EPD_DisplayStringAt(185, 12, "|Load On", LEFT_MODE);
	}
	BSP_EPD_RefreshDisplay();
}

